# Agenda, week 2

1. Q&A
2. Data frames
    - Creating them
    - Indexes and column names
    - Retrieving from them
    - Methods and attributes that we'll want to use
    - `.loc` and mask indexes
3. Creating data frames from files
    - CSV
    - Other formats, as well
    - Retrieving data from the Internet

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
s = Series([10, 20, 30, np.nan, 50, 60, 70, np.nan, np.nan, 100, 200],
          index=list('abcdefghijk'))
s

a     10.0
b     20.0
c     30.0
d      NaN
e     50.0
f     60.0
g     70.0
h      NaN
i      NaN
j    100.0
k    200.0
dtype: float64

In [6]:
s.dropna()    # this method removes the NaN values from a series, and returns the new series without NaN -- the original is unchanged

a     10.0
b     20.0
c     30.0
e     50.0
f     60.0
g     70.0
j    100.0
k    200.0
dtype: float64

In [7]:
s  # how can it be that we still have NaN values here??

a     10.0
b     20.0
c     30.0
d      NaN
e     50.0
f     60.0
g     70.0
h      NaN
i      NaN
j    100.0
k    200.0
dtype: float64

In [8]:
# how can you actually remove NaN values from a series?

# s = s.dropna()   # this returns the new series that dropna returned, and assigns it back to s, replacing the original one

In [9]:
s.fillna(999)   # new series with 999 instead of NaN is returned, but the original (s) is still unchanged

a     10.0
b     20.0
c     30.0
d    999.0
e     50.0
f     60.0
g     70.0
h    999.0
i    999.0
j    100.0
k    200.0
dtype: float64

In [10]:
s.interpolate()  # returns a new series, but doesn't change the original

a     10.0
b     20.0
c     30.0
d     40.0
e     50.0
f     60.0
g     70.0
h     80.0
i     90.0
j    100.0
k    200.0
dtype: float64

By having methods return a new series/data frame, rather than modify the original, you can "chain" methods and perform longer, more interesting queries without making any assignments.

# Data frames

If a series is a 1D data structure, with an index and values (all of which are one dtype), then a data frame is a 2D data structure, similar to an Excel spreadsheet.

A data frame:

- Has an index, which refers to the rows
- Has column names, which refer to the columns
- Each column is a series! This means that each column has a dtype. You can have different dtypes in different columns, but all of the values in a single column must be the same.

In [11]:
# creating a data frame

# I'll create this using a list of lists


df = DataFrame([[10, 20, 30],
                [40, 50, 60],
                [70, 80, 90],
                [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

We can see in our data frame:

- The index goes from 0-3, along the left side, just as we saw with a series
- The column names goes from 0-2, along the top, naming the columns

In [12]:
# Can I work with this data frame? Yes. But it's usually better to give names to our index and our columns.
# we can do that at creation time by passing the "index" and "columns" keyword arguments.

df = DataFrame([[10, 20, 30],
                [40, 50, 60],
                [70, 80, 90],
                [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [13]:
# I can get the index for df with df.index

df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
# I can get the columns for df with df.columns

df.columns

Index(['x', 'y', 'z'], dtype='object')

# To retrieve a row, we can use either `.loc` or `.iloc` -- just like with a series

In [15]:
df.loc['a']  # get row 'a'

x    10
y    20
z    30
Name: a, dtype: int64

In [16]:
df.loc['c']

x    70
y    80
z    90
Name: c, dtype: int64

In [17]:
# fancy indexing!

df.loc[['a', 'c']]   # 2 rows means... a data frame!

    x   y   z
a  10  20  30
c  70  80  90

In [19]:
df.loc['b':'d']  # .loc + a slice give us "up to and including"

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [20]:
df.iloc[0]   # row in position 0

x    10
y    20
z    30
Name: a, dtype: int64

In [21]:
df.iloc[2]  # row in position 2

x    70
y    80
z    90
Name: c, dtype: int64

In [23]:
df.iloc[[0, 2]]   # fancy indexing with iloc

    x   y   z
a  10  20  30
c  70  80  90

# Note: If you want to retrieve columns, use just `[]`

- To retrieve rows based on the index/position, use `loc` and `iloc`
- To retrieve columns, use just `[]`

In [24]:
df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [25]:
df['z']

a     30
b     60
c     90
d    120
Name: z, dtype: int64

In [26]:
df['x':'z']  # sadly, this syntax is understood by Pandas to mean: Use the rows!

Empty DataFrame
Columns: [x, y, z]
Index: []

In [28]:
df[['x', 'z']]  # fancy indexing on the columns!

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

# Exercise: Grocery store

1. Create a data frame describing products in a grocery store. The columns will be `product`, `price`, `department`. You should have 5 total products.  Each product will be a new row in the data frame. The index should be the numeric ID for that product. Each product's ID is a 3-digit number.
2. Retrieve the products as positions 0 and 3. Then, using their product IDs, using `.loc` to retrieve the same products.
3. Retrieve just the `price` column. What is the mean price of items in your store?

In [31]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns=['product', 'price', 'department'])
df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [32]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=list('abcde'),   # what is this?
              columns=['product', 'price', 'department'])
df

      product  price   department
a       apple     10      produce
b      banana      5      produce
c    computer   1000  electronics
d    doorstop      2     hardware
e  enchiladas      5         food

In [33]:
# index must get a list
# if I run list() on an iterable, I get a list back whose elements are the values from the iterable

list('abcde') # this runs a for loop on the string, and each iteration's value is a list element

['a', 'b', 'c', 'd', 'e']

In [34]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns='product price department'.split())
df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [35]:
# Retrieve the products as positions 0 and 3. Then, using their product IDs, using .loc to retrieve the same products.

df.iloc[[0, 3]]

      product  price department
101     apple     10    produce
301  doorstop      2   hardware

In [36]:
df.loc[[101, 301]]

      product  price department
101     apple     10    produce
301  doorstop      2   hardware

In [38]:
# Retrieve just the price column. What is the mean price of items in your store?

df['price'].mean()

np.float64(204.4)

In [39]:
# How can I add a new column to my data frame?
# Answer: assign to it

df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [40]:
# if you assign to a column, and the column didn't previously exist, you have added it!

df['tax'] = [1,2,3,4,5]
df

        product  price   department  tax
101       apple     10      produce    1
102      banana      5      produce    2
201    computer   1000  electronics    3
301    doorstop      2     hardware    4
401  enchiladas      5         food    5

In [41]:
# if you assign to a column, and the column *DID* previously exist, you have replaced the existing one.

df['tax'] = [10, 20, 30, 40, 50]
df

        product  price   department  tax
101       apple     10      produce   10
102      banana      5      produce   20
201    computer   1000  electronics   30
301    doorstop      2     hardware   40
401  enchiladas      5         food   50

In [42]:
# You can use all of the tools we've seen so far to calculate and create new series
# for example, let's assume that the tax on each good is 10%. Create a new tax column
# that reflects this.

df['tax'] = df['price'] * 0.1
df

        product  price   department    tax
101       apple     10      produce    1.0
102      banana      5      produce    0.5
201    computer   1000  electronics  100.0
301    doorstop      2     hardware    0.2
401  enchiladas      5         food    0.5

In [43]:
# renaming a column... there a few ways

# (1) you can just assign to df.columns a list of names, and they'll *all* get changed

In [45]:
# (2) you can use df.rename, passing a dict whose keys are original column names
# and whose values are new column names. Pass this to the "columns" keyword argument

df.rename(columns={'tax':'sales_tax'})

        product  price   department  sales_tax
101       apple     10      produce        1.0
102      banana      5      produce        0.5
201    computer   1000  electronics      100.0
301    doorstop      2     hardware        0.2
401  enchiladas      5         food        0.5

In [47]:
# how do I drop a column?
# the "drop" method, which similarly takes a "columns" keyword argument

df.drop(columns=['tax'])

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

# Retrieving with `.loc` -- the 2-argument version

So far, we have used `.loc` to indicate what rows we want to get. But it turns out that there is a 2-argument version of `.loc`.

In all versions, the first argument is what I call the "row selector." You indicate what rows you want, and you get those rows. This can be a single index, or it can be a fancy index. (We're going to add to this later, with a boolean index.)

If you pass a second argument to `.loc`, that is what I call the "column selector." You can indicate what columns you want. This can be a single column name, or a list of column names.

In [49]:
# 2-column version of .lob

df.loc[
    101,            # row selector -- a single index
    'department'    # column selector -- a single column
    ]

'produce'

In [50]:
df.loc[
    [101, 301],   # row selector -- a fancy index
    'department'  # column selector -- a single column
    ]

101     produce
301    hardware
Name: department, dtype: object

In [51]:
df.loc[
    [101, 301],   # row selector -- a fancy index
    ['department', 'price']   # column selector -- 2 columns 
    ]

    department  price
101    produce     10
301   hardware      2

# Exercise: Family members

1. Create a data frame with 5 family members (or friends or make things up, if you don't have family/friends). Each row is one person. The columns will be named `name`, `age`, `shoesize`.
2. What is the mean `shoesize` for members of your family?
3. What are the `min` and `max` ages for members of your family?
4. Retrieve all of the names and their shoe sizes.
5. Retrieve the age and name for the person in row 0.

In [53]:
df = DataFrame([  ['Reuven', 55, 46],
                  ['SC', 53, 40],
                  ['AM', 25, 40],
                  ['SB', 23, 40],
                  ['AD', 20, 44]],
              columns='name age shoesize'.split())
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [54]:
df['shoesize'].mean()

np.float64(42.0)

In [55]:
df['age'].min()

np.int64(20)

In [56]:
df['age'].max()

np.int64(55)

In [58]:
df['age'].describe()

count     5.000000
mean     35.200000
std      17.268468
min      20.000000
25%      23.000000
50%      25.000000
75%      53.000000
max      55.000000
Name: age, dtype: float64

In [59]:
# Retrieve all of the names and their shoe sizes.

df[['name', 'shoesize']]

     name  shoesize
0  Reuven        46
1      SC        40
2      AM        40
3      SB        40
4      AD        44

In [60]:
# Retrieve the age and name for the person in row 0.

df.loc[
    0,              # row selector
    ['name', 'age'] # column selector
    ]

name    Reuven
age         55
Name: 0, dtype: object

# Next up

1. Useful methods and attributes
2. Boolean/mask indexes

In [61]:
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

# General rule of thumb

If a method exists for a Pandas series, then it almost certainly exists for a data frame, too.

In the case of the data frame, the method will be invoked on each column, and we'll get a result for each column.

In [62]:
# we've now seen that we can set an index when we create a data frame
# sometimes, we want to "promote" a regular column to be an index
# sometimes, we want to "demote" an index to be a regular column

# we can turn a column into the index with the set_index methods
df.set_index('name')  # this returns a new data frame with the "name" index -- it doesn't change the original

        age  shoesize
name
Reuven   55        46
SC       53        40
AM       25        40
SB       23        40
AD       20        44

In [63]:
# method chaining
# we open () on a line by themselves, and close them on a line by themselves
# Python's usually strict syntax melts away, since these are "on a single, long line"

(
    df                  
    .set_index('name')   # set the index to be name
    .loc[['SC', 'SB']]   # retrieve rows for two names
)

      age  shoesize
name
SC     53        40
SB     23        40

In [64]:
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [67]:

(
    df                  
    .set_index('name')   # set the index to be name
    .loc[
        ['SC', 'SB'],  # retrieve two rows
        'age'          # get the "age" column
        ]
    .mean()            # get the mean of these two people's ages
)

np.float64(38.0)

In [68]:
# if you really want to set the index permanently, you can!
# just assign the result of set_index back to the data frame

df = df.set_index('name')
df

        age  shoesize
name
Reuven   55        46
SC       53        40
AM       25        40
SB       23        40
AD       20        44

In [70]:
# how can I undo this? I can say 

df.reset_index('name')  # this doesn't change df! But it does return a new data frame on which we can work

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [71]:
# what about NaN?

df = DataFrame([  ['Reuven', 55, np.nan],
                  ['SC', 53, 40],
                  ['AM', 25, np.nan],
                  ['SB', np.nan, 40],
                  ['AD', np.nan, np.nan]],
              columns='name age shoesize'.split())
df

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN
3      SB   NaN      40.0
4      AD   NaN       NaN

In [72]:
# can I remove the NaNs? Yes, I can invoke df.dropna
# in a series, dropna returns a new series without any NaN values
# in a data frame, dropna returns a new data frame without any ROWS containing NaN values!

df.dropna()

  name   age  shoesize
1   SC  53.0      40.0

In [73]:
# one solution is to set the threshold for how many *good values* you need
# if you say thresh=2, then you must have at least 2 non-NaN values in a row to keep it

df.dropna(thresh=2)

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN
3      SB   NaN      40.0

In [74]:
# another solution is to set the "subset", meaning the column(s) where you cannot have NaN. Other columns, we don't care

df.dropna(subset='age')

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN

In [80]:
# of course, you can mix and match these

df.dropna(thresh=2, 
          subset=['name', 'age'])

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN

In [77]:
df.fillna(999)

     name    age  shoesize
0  Reuven   55.0     999.0
1      SC   53.0      40.0
2      AM   25.0     999.0
3      SB  999.0      40.0
4      AD  999.0     999.0

In [83]:
# another way: pass the mean

# remember: any series method can be run on a data frame, and we'll get one value back for each column

(
    df
    .set_index('name')
    .fillna( df.set_index('name').mean()  )
)

              age  shoesize
name
Reuven  55.000000      40.0
SC      53.000000      40.0
AM      25.000000      40.0
SB      44.333333      40.0
AD      44.333333      40.0

In [84]:
# if I have a data frame containing some NaN values
# I can run df.fillna
# often, I'll feed to df.fillna the result of df.mean()!
# so long as I only have numeric columns, that works just fine

In [86]:
# we saw with a series we can run head/tail to get the first/last elements in a series
# in a data frame, we'll see the first/last rows

df.head(2)

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0

In [87]:
df.tail(3)

  name   age  shoesize
2   AM  25.0       NaN
3   SB   NaN      40.0
4   AD   NaN       NaN

In [88]:
# nullable types -- we should be able to have ints and strings that play well with np.nan, without forcing floats or weirdness
# pandas has something called pd.NA, which is slowly starting to be useful
# PyArrow, which is a replacement for the NumPy underlying layer, has a NA value, too

In [91]:
df.isna()  # this will return True/False for each value

    name    age  shoesize
0  False  False      True
1  False  False     False
2  False  False      True
3  False   True     False
4  False   True      True

In [92]:
df.notna()

   name    age  shoesize
0  True   True     False
1  True   True      True
2  True   True     False
3  True  False      True
4  True  False     False

In [93]:
# with a series, we have the "describe" method, which returns a summary of the data's shape
# what about a data frame?

df.describe()

             age  shoesize
count   3.000000       2.0
mean   44.333333      40.0
std    16.772994       0.0
min    25.000000      40.0
25%    39.000000      40.0
50%    53.000000      40.0
75%    54.000000      40.0
max    55.000000      40.0

# Exercise: More with groceries

1. (Re)define the data frame with groceries.
2. Set the index of the data frame to be the product name.
3. Retrieve three items via the index, and find the min and max prices for them.
4. Set the index to be the department/category. Find the mean price for products in that category.

In [94]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns='product price department'.split())
df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [98]:
(
    df
    .set_index('product')
    .loc[
        ['apple', 'computer', 'enchiladas'],   # row selector
        'price'
        ]
    .agg(['min', 'max'])  # pass agg a list of the aggregation methods I want to use
)

min       5
max    1000
Name: price, dtype: int64

In [100]:
(
    df
    .set_index('department')
    .loc['produce', 'price']
    .mean()
)

np.float64(7.5)

# Boolean/mask indexes

You might remember that last week, we were able to retrieve parts of a series using a broadcast condition, which returns a boolean series. We then applied that boolean series as a "mask index" to our series, and got only those values that matched the condition.

In [101]:
s = Series([10, 15, 20, 25, 30, 50, 55, 75])

s % 2 == 0   # after dividing each element of s by 2, do we have 0 remainder? aka, is it even?

0     True
1    False
2     True
3    False
4     True
5     True
6    False
7    False
dtype: bool

In [102]:
s.loc[  s % 2 == 0 ]

0    10
2    20
4    30
5    50
dtype: int64

In [105]:
# the same logic applies to our data frame!
# we create a boolean series based on a condition on one column
# we apply that boolean series as a mask index to df.loc
# this filters all of the columns based on that boolean

df.loc[   df['price'] < 10 ]   # get the rows from df where price < 10

        product  price department
102      banana      5    produce
301    doorstop      2   hardware
401  enchiladas      5       food

In [106]:
df.loc[
    df['price'] < 10,    # get the rows from df where price < 10
    'price'              # grab the price
    ].max()

np.int64(5)

# Exercise

1. Again, use the grocery store data
2. Add a new column, tax, which is the percentage tax applied to each item. Vary it according to the department.
3. Add a new column, `total_price`, which will be the total price after adding the tax.
4. Set the product names to be the index
5. Retrieve two products, and calculate the mean total_price for them.

In [107]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns='product price department'.split())

df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [108]:
df['tax'] = [0.1, 0.1, 0.2, 0.3, 0.1]

In [109]:
df

        product  price   department  tax
101       apple     10      produce  0.1
102      banana      5      produce  0.1
201    computer   1000  electronics  0.2
301    doorstop      2     hardware  0.3
401  enchiladas      5         food  0.1

In [112]:
df['total_price'] = df['price'] + df['price'] * df['tax'] 
df

        product  price   department  tax  total_price
101       apple     10      produce  0.1         11.0
102      banana      5      produce  0.1          5.5
201    computer   1000  electronics  0.2       1200.0
301    doorstop      2     hardware  0.3          2.6
401  enchiladas      5         food  0.1          5.5

In [116]:
# Set the product names to be the index
# Retrieve two products, and calculate the mean total_price for them.

(
    df
    .set_index('product')
    .loc[
        ['apple', 'enchiladas'],   # row selector
        'total_price'
        ]
    .mean()
)

np.float64(8.25)

In [118]:
tax_rates = {'produce':0.1, 'electronics':0.2, 'hardware':0.3, 'food':0.1}

df['department'].map(tax_rates)

101    0.1
102    0.1
201    0.2
301    0.3
401    0.1
Name: department, dtype: float64

# Next up

- A little bit more with boolean indexes and some methods
- Real-world data!

https://files.lerner.co.il/data-science-exercise-files.zip

In [119]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns='product price department'.split())

# set up tax
tax_rates = {'produce':0.1, 'electronics':0.2, 'hardware':0.3, 'food':0.1}
df['tax'] = df['department'].map(tax_rates)

df

        product  price   department  tax
101       apple     10      produce  0.1
102      banana      5      produce  0.1
201    computer   1000  electronics  0.2
301    doorstop      2     hardware  0.3
401  enchiladas      5         food  0.1

In [121]:
df['total_price'] = df['price'] + df['price']* df['tax']
df

        product  price   department  tax  total_price
101       apple     10      produce  0.1         11.0
102      banana      5      produce  0.1          5.5
201    computer   1000  electronics  0.2       1200.0
301    doorstop      2     hardware  0.3          2.6
401  enchiladas      5         food  0.1          5.5

In [122]:
# every column in a data frame is a Pandas series
# we can see this if we ask for the .dtypes attribute

df.dtypes

product         object
price            int64
department      object
tax            float64
total_price    float64
dtype: object

In [123]:
# what happens when we retrieve a row?

df.loc[101]

product          apple
price               10
department     produce
tax                0.1
total_price       11.0
Name: 101, dtype: object

In [124]:
# you should probably only do this when you'll also use a column selector!

df.loc[
    101,               # row index 101
    ['price', 'tax']   # column names price + tax
    ]

price     10
tax      0.1
Name: 101, dtype: object

In [125]:
df.loc[
    101,               # row index 101
    ['price', 'tax']   # column names price + tax
    ] = [20, 0.15]     # we can assign based on .loc!

In [126]:
df

        product  price   department   tax  total_price
101       apple     20      produce  0.15         11.0
102      banana      5      produce  0.10          5.5
201    computer   1000  electronics  0.20       1200.0
301    doorstop      2     hardware  0.30          2.6
401  enchiladas      5         food  0.10          5.5

In [129]:
# the ! at the start of the line lets me run Unix commands if I'm on a Unix machine

!ls

airlines.dat                       OReilly - 2025-11November-06.ipynb
airports                           OReilly - 2025-11November-13.ipynb
burrito_current.csv                pyproject.toml
celebrity_deaths_2016.csv          README.md
languages.csv                      taxi.csv
main.py                            titanic3.csv
OReilly - 2025-11November-06.html  uv.lock

# Loading data from files

The most common format for sharing data is CSV, "comma separated values":

- Each record is on one line of a text file
- Each field is separated from other fields with a comma
- Each line must have the same number of fields
- If you must include a comma in the data, then the field needs to have `""` around the value

Reading in a CSV file means that Pandas needs to guess what dtype to assign each column. We can influence that, or re-assign, if we need... but often it's right.

To read a CSV file, we'll use the `pd.read_csv` function. This returns a new data frame based on the CSV file.

In [130]:
filename = 'taxi.csv'

df = pd.read_csv(filename)

In [131]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

# Exercise: Weird taxi rides

1. Read `taxi.csv` (from my zipfile) into a data frame. The file contains 9,999 taxi rides from NYC in 2015 across several days. It is *not* a representative sample.
2. How many rides went 0 miles? How much, on average, did the passengers pay for such rides (`total_amount`)?
3. How many rides cost 0 dollars? How far, on average, did people go for such a cheap price (`trip_distance`)?
4. How many rides had 0 passengers? Give the mean for `trip_distance` and `total_amount`.

In [132]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(
    filepath_or_buffer: FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str],
    *,
    sep: str | None | lib.NoDefault = <no_default>,
    delimiter: str | None | lib.NoDefault = None,
    header: int | Sequence[int] | None | Literal['infer'] = 'infer',
    names: Sequence[Hashable] | None | lib.NoDefault = <no_default>,
    index_col: IndexLabel | Literal[False] | None = None,
    usecols: UsecolsArgType = None,
    dtype: DtypeArg | None = None,
    engine: CSVEngine | None = None,
    converters: Mapping[Hashable, Callable] | None = None,
    true_values: list | None = None,
    false_values: list | None = None,
    skipinitialspace: bool = False,
    skiprows: list[int] | int | Callable[[Hashable], bool] | None = None,
    skipfooter: int = 0,
    nrows: int | None = None,
    na_values: Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None = None,
    keep_default_na: bool = True,
    na_filter: bool = True,
    verbose: bool | lib.NoDefault = <no_default>,
    skip_blank_lines: bool = True,
    parse_dates: bool | Sequence[Hashable] | None = None,
    infer_datetime_format: bool | lib.NoDefault = <no_default>,
    keep_date_col: bool | lib.NoDefault = <no_default>,
    date_parser: Callable | lib.NoDefault = <no_default>,
    date_format: str | dict[Hashable, str] | None = None,
    dayfirst: bool = False,
    cache_dates: bool = True,
    iterator: bool = False,
    chunksize: int | None = None,
    compression: CompressionOptions = 'infer',
    thousands: str | None = None,
    decimal: str = '.',
    lineterminator: str | None = None,
    quotechar: str = '"',
    quoting: int = 0,
    doublequote: bool = True,
    escapechar: str | None = None,
    comment: str | None = None,
    encoding: str | None = None,
    encoding_errors: str | None = 'strict',
    dialect: str | csv.Dialect | None = None,
    on_bad_lines: str = 'error',
    delim_whitespace: bool | lib.NoDefault = <no_default>,
    low_memory: bool = True,
    memory_map: bool = False,
    float_precision: Literal['high', 'legacy'] | None = None,
    storage_options: StorageOptions | None = None,
    dtype_backend: DtypeBackend | lib.NoDefault = <no_default>
) -> DataFrame | TextFileReader
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Character or regex pattern to treat as the delimiter. If ``sep=None``, the
        C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator from only the first valid
        row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
        In addition, separators longer than 1 character and different from
        ``'\s+'`` will be interpreted as regular expressions and will also force
        the use of the Python parsing engine. Note that regex delimiters are prone
        to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, optional
        Alias for ``sep``.
    header : int, Sequence of int, 'infer' or None, default 'infer'
        Row number(s) containing column labels and marking the start of the
        data (zero-indexed). Default behavior is to infer the column names: if no ``names``
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly to ``names`` then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a :class:`~pandas.MultiIndex` on the columns
        e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : Sequence of Hashable, optional
        Sequence of column labels to apply. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : Hashable, Sequence of Hashable or False, optional
      Column(s) to use as row label(s), denoted either by column labels or column
      indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
      will be formed for the row labels.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g., when you have a malformed file with delimiters at
      the end of each line.
    usecols : Sequence of Hashable or Callable, optional
        Subset of columns to select, denoted either by column labels or column indices.
        If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in ``names`` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
        preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
        for columns in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to ``True``. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    dtype : dtype or dict of {Hashable : dtype}, optional
        Data type(s) to apply to either the whole dataset or individual columns.
        E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
        Use ``str`` or ``object`` together with suitable ``na_values`` settings
        to preserve and not interpret ``dtype``.
        If ``converters`` are specified, they will be applied INSTEAD
        of ``dtype`` conversion.

        .. versionadded:: 1.5.0

            Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
            the default determines the ``dtype`` of the columns which are not explicitly
            listed.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The 'pyarrow' engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict of {Hashable : Callable}, optional
        Functions for converting values in specified columns. Keys can either
        be column labels or column indices.
    true_values : list, optional
        Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
    false_values : list, optional
        Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : int, list of int or Callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (``int``)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
        Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
        per-column ``NA`` values.  By default the following values are interpreted as
        ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
        "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
        "n/a", "nan", "null ".

    keep_default_na : bool, default True
        Whether or not to include the default ``NaN`` values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
          is appended to the default ``NaN`` values used for parsing.
        * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
          the default ``NaN`` values are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
          the ``NaN`` values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
          strings will be parsed as ``NaN``.

        Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of ``na_values``). In
        data without any ``NA`` values, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of ``NA`` values placed in non-numeric columns.

        .. deprecated:: 2.2.0
    skip_blank_lines : bool, default True
        If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
    parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
        The behavior is as follows:

        * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
          ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
        * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
          as a single date column. Values are joined with a space before parsing.
        * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
          result 'foo'. Values are joined with a space before parsing.

        If a column or index cannot be represented as an array of ``datetime``,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an ``object`` data type. For
        non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
        :func:`~pandas.read_csv`.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
        format of the ``datetime`` strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.

        .. deprecated:: 2.0.0
            A strict version of this argument is now the default, passing it has no effect.

    keep_date_col : bool, default False
        If ``True`` and ``parse_dates`` specifies combining multiple columns then
        keep the original columns.
    date_parser : Callable, optional
        Function to use for converting a sequence of string columns to an array of
        ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. pandas will try to call ``date_parser`` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by ``parse_dates`` into a single array
        and pass that; and 3) call ``date_parser`` once for each row using one or
        more strings (corresponding to the columns defined by ``parse_dates``) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`~pandas.to_datetime` as-needed.
    date_format : str or dict of column -> format, optional
        Format to use for parsing dates when used in conjunction with ``parse_dates``.
        The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
        `strftime documentation
        <https://docs.python.org/3/library/datetime.html
        #strftime-and-strptime-behavior>`_ for more information on choices, though
        note that :const:`"%f"` will parse all the way up to nanoseconds.
        You can also pass:

        - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
            time string (not necessarily in exactly the same format);
        - "mixed", to infer the format for each element individually. This is risky,
            and you should probably use it along with `dayfirst`.

        .. versionadded:: 2.0.0
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If ``True``, use a cache of unique, converted dates to apply the ``datetime``
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

    iterator : bool, default False
        Return ``TextFileReader`` object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Number of lines to read from the file per chunk. Passing a value will cause the
        function to return a ``TextFileReader`` object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
        other key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str (length 1), optional
        Character acting as the thousands separator in numerical values.
    decimal : str (length 1), default '.'
        Character to recognize as decimal point (e.g., use ',' for European data).
    lineterminator : str (length 1), optional
        Character used to denote a line break. Only valid with C parser.
    quotechar : str (length 1), optional
        Character used to denote the start and end of a quoted item. Quoted
        items can include the ``delimiter`` and it will be ignored.
    quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
        ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
        characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
        or ``lineterminator``.
    doublequote : bool, default True
       When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        Character used to escape other characters.
    comment : str (length 1), optional
        Character indicating that the remainder of line should not be parsed.
        If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter ``header`` but not by
        ``skiprows``. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
        treated as the header.
    encoding : str, optional, default 'utf-8'
        Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    encoding_errors : str, optional, default 'strict'
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
        ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
        override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
        documentation for more details.
    on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

        - ``'error'``, raise an Exception when a bad line is encountered.
        - ``'warn'``, raise a warning when a bad line is encountered and skip that line.

In [133]:
df = pd.read_csv(filename)
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [138]:
# 2. How many rides went 0 miles? How much, on average, did the passengers pay for such rides (`total_amount`)?

(
    df
    .loc[
        df['trip_distance'] == 0,  # row selector
        'total_amount' # column selector
        ]
    .mean()
)

np.float64(31.581940298507465)

In [144]:
# 3. How many rides cost 0 dollars? How far, on average, did people go for such a cheap price (`trip_distance`)?

(
    df
    .loc[
        df['total_amount'] <= 0,  # row selector
        'trip_distance' # column selector
        ]
    .mean()
)

np.float64(0.6066666666666667)

In [147]:
# 4. How many rides had 0 passengers? Give the mean for `trip_distance` and `total_amount`.

(
    df
    .loc[
        df['passenger_count'] == 0,
        ['trip_distance', 'total_amount']
        ]
    .mean()
)

trip_distance     4.60
total_amount     25.57
dtype: float64

In [148]:
!ls *.csv

burrito_current.csv       languages.csv             titanic3.csv
celebrity_deaths_2016.csv taxi.csv

# Exercise: Titanic

1. Load the `titanic3.csv` file into a data frame.
2. Find the mean age of people who survived.
3. Find the mean age of men on the ship.
4. Find the mean age of women on the ship.

In [150]:
df = pd.read_csv('titanic3.csv')

df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [151]:
df['survived'].value_counts()

survived
0.0    809
1.0    500
Name: count, dtype: int64

In [155]:
# 2. Find the mean age of people who survived.

(
    df
    .loc[ df['survived'] == 1 ,  # row selector
        'age']  # column selector
    .agg(['mean', 'median'])
)

mean      28.918228
median    28.000000
Name: age, dtype: float64

In [156]:
# 3. Find the mean age of men on the ship.

(
    df
    .loc[ df['sex'] == 'male' ,  # row selector
        'age']  # column selector
    .mean()
)

np.float64(30.5852329787234)

In [157]:
# 4. Find the mean age of women on the ship.


(
    df
    .loc[ df['sex'] == 'female' ,  # row selector
        'age']  # column selector
    .mean()
)

np.float64(28.6870706185567)

# Next up

1. Common options to `read_csv`
2. Other file formats
3. Retrieving data from the Internet

In [159]:
# what if I don't want all of the columns?

pd.read_csv('taxi.csv',
           usecols=['passenger_count', 'trip_distance', 'total_amount'])

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]